trade_exp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fdb01f6-4967-4863-8211-300891e04633">
  <name>АналогиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5101c189-e0d9-4d7a-ad43-75fe9ff7c368">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c8b16b72-9107-42cd-bc6b-e7ed0308c512">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ed55715d-dbff-4f56-9d3f-c1366a117f76">
    <name>ОбратнаяАналогия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="56dd2c22-0fcc-4868-b308-1d6f8a56ed55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ed23a32e-e185-4b37-b18e-204672040e54">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8754e396-036b-4c70-867f-6bf8ed950029">
    <name>АналогНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26f13074-bd31-45ce-8888-d525330b5e0b">
    <name>АналогХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/АналогиНоменклатуры/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗагрузитьДанныеВРегистрНаСервере()
	Для каждого Строка из Аналоги Цикл
		Если РегистрыСведений.АналогиНоменклатуры.ЕстьАналогСТемжеПриоритетом(Строка) Тогда
			Сообщить("По номенклатуре "+Строка.Номенклатура+" есть запись стаким же приоритетом!");
			Продолжить;
		КонецЕсли;
		
		Попытка
			НачатьТранзакцию();
			НоваяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
			Если Строка.ОбратнаяАналогия Тогда
				ОбратнаяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
				ОбратнаяЗапись.Номенклатура = Строка.АналогНоменклатуры;
				ОбратнаяЗапись.АналогНоменклатуры = Строка.Номенклатура;
				ОбратнаяЗапись.Характеристика = Строка.АналогХарактеристики;
				ОбратнаяЗапись.АналогХарактеристики = Строка.Характеристика;
				ОбратнаяЗапись.Кратность = ?(Строка.Кратность <> 0,Окр(1/Строка.Кратность,1,РежимОкругления.Окр15как20),0);
				ОбратнаяЗапись.ОбратнаяАналогия = Истина;
				ОбратнаяЗапись.Приоритет= Строка.Приоритет;
				ОбратнаяЗапись.Записать();
			КонецЕсли;
			НоваяЗапись.Записать();
			ЗафиксироватьТранзакцию();	
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВРегистр(Команда)
	ЗагрузитьДанныеВРегистрНаСервере();
	//Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоНоменклатуреПриИзменении(Элемент)
	ЭтаФорма.Элементы.Номенклатура.Доступность = ПоНоменклатуре;
	ЭтаФорма.Элементы.Характеристика.Доступность = ПоНоменклатуре;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Оповещение = Новый ОписаниеОповещения("ПередОчищениемЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, "Вы действительно хотите очистить табличную часть?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте 
Процедура ПередОчищениемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Аналоги.Очистить();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаЗавершение",ЭтотОбъект);   	
	ОткрытьФорму("РегистрСведений.АналогиНоменклатуры.Форма.ФормаДоп", ,ЭтаФорма,,,,Оповещение,);
КонецПроцедуры


&НаКлиенте 
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено тогда
		ЗагрузитьРезультат(Результат);
	конецесли;
КонецПроцедуры  

&НаСервере
Процедура ЗагрузитьРезультат(Результат)
	Аналоги.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Строка = Элементы.Аналоги.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(Строка.Номенклатура) ИЛИ Не ЗначениеЗаполнено(Строка.АналогНоменклатуры) Тогда
		ОтменаРедактирования = Истина;
		Сообщить("Поля: 'Номенклатура' и 'АналогНоменклатуры' обязательны для заполнения!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналогиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если ПоНоменклатуре И ЗначениеЗаполнено(Номенклатура) Тогда
			Элементы.Аналоги.ТекущиеДанные.Номенклатура = Номенклатура;
			Если ЗначениеЗаполнено(Характеристика) Тогда
				Элементы.Аналоги.ТекущиеДанные.Характеристика = Характеристика;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
